{
    "title": "Le Socket",
    "subTitle1" : "Tipologie di socket",
    "subTitle11" : "Stream Sockets (TCP)",
    "subTitle12" : "Datagram Sockets (UDP)",
    "subTitle2" : "Socket e Porta",
    "subTitle3" : "Come funzionano le Socket?",
    "content1": "Le <a href='glossario.html' style='text-decoration: none;' class='text-warning'>socket</a> sono punti di comunicazione utilizzati dalle applicazioni per inviare e ricevere dati tramite una rete. In sostanza, sono dei canali virtuali che permettono a due dispositivi di comunicare, che possono essere collegati tramite una rete locale (<a href='glossario.html' style='text-decoration: none;' class='text-warning'>LAN</a>) o attraverso Internet. Ogni socket è definita da un <a href='glossario.html' style='text-decoration: none;' class='text-warning'>indirizzo IP</a> e un numero di <a href='glossario.html' style='text-decoration: none;' class='text-warning'>porta</a>, che identificano in modo univoco il dispositivo e il servizio a cui è associato il socket. Per le socket si ha un client e un server tra i quali si stabilisce la connessione.<br>Le socket sono ampiamente utilizzate in tutti i tipi di comunicazione di rete, inclusi web browsing, posta elettronica, streaming video e molto altro.",
    "content21": "Esistono principalmente due tipologie di socket: <strong>Stream Sockets</strong> e <strong>Datagram Sockets</strong>, ognuna con caratteristiche e utilizzi differenti.",
    "content22": "Le Stream Sockets sono utilizzate per le comunicazioni basate sul protocollo <a href='tcp.html' style='text-decoration: none;' class='text-warning'>TCP</a> (Transmission Control Protocol). Queste socket garantiscono una connessione stabile e affidabile tra due dispositivi. Durante la comunicazione, TCP si assicura che tutti i pacchetti di dati arrivino nell'ordine giusto, senza errori e senza perdite. È ideale per applicazioni che richiedono una trasmissione di dati sicura e ordinata, come il web browsing o la posta elettronica.<br><br>Un esempio di Stream Socket è una connessione HTTP tra il browser e un server web.",
    "content23": "Le Datagram Sockets sono utilizzate per le comunicazioni basate sul protocollo <a href='tcp.html' style='text-decoration: none;' class='text-warning'>UDP</a> (User Datagram Protocol). A differenza di TCP, UDP non garantisce la consegna o l'ordine dei pacchetti. Questo rende UDP più veloce ma meno sicuro rispetto a TCP. Le Datagram Sockets sono adatte per applicazioni che necessitano di alta velocità e tollerano la perdita di qualche pacchetto di dati, come lo streaming video o i giochi online in tempo reale.<br><br>Un esempio di Datagram Socket è un'applicazione di video streaming che invia pacchetti di dati a intervalli regolari.",
    "content3": "Una socket è definita dalla combinazione di un indirizzo IP e un numero di porta. L'indirizzo IP identifica univocamente il dispositivo sulla rete, mentre il numero di porta identifica un'applicazione o un servizio specifico su quel dispositivo. Ad esempio, il servizio HTTP di un server web è tipicamente associato alla porta 80, mentre il servizio HTTPS si trova sulla porta 443.<br><br>Le porte vanno da 0 a 65535 e sono suddivise in tre categorie principali:<ul><li><strong>Porte Well Known:</strong> vanno da 0 a 1023 e sono riservate per i servizi standard (ad esempio, la porta 80 per HTTP).</li><li><strong>Porte registrate:</strong> vanno da 1024 a 49151 e sono usate per servizi non standard o per applicazioni specifiche.</li><li><strong>Porte dinamiche o private:</strong> vanno da 49152 a 65535 e sono utilizzate per connessioni temporanee o per applicazioni client.</li></ul>",
    "content4": "Il funzionamento di una socket implica due fasi principali: la connessione e la trasmissione dei dati. La prima fase prevede che una socket sul <a href='glossario.html' style='text-decoration: none;' class='text-warning'>client</a> si connetta a una socket sul <a href='glossario.html' style='text-decoration: none;' class='text-warning'>server</a> utilizzando l'indirizzo IP e il numero di porta del server. Una volta stabilita la connessione, i dati possono essere inviati e ricevuti attraverso la socket utilizzando il protocollo scelto <a href='tcp.html' style='text-decoration: none;' class='text-warning'>(TCP o UDP)</a>.<br><br>In generale, una socket invia dati in un formato di byte (stream di bit) e i dati devono essere elaborati dall'applicazione per essere comprensibili. La gestione delle connessioni e la trasmissione dei dati è generalmente trasparente per gli utenti, che interagiscono con l'applicazione senza preoccuparsi di come i dati vengano effettivamente trasferiti attraverso la rete.",
    "image1Src": "imgs/socket_socket.png",
    "image1Alt": "Img socket",
    "image1Fonte": "Fonte: informaticabrutta.it",
    "image2Src": "imgs/socket_tcp.png",
    "image2Alt": "img tipi socket",
    "image3Src": "imgs/socket_ports.com_.jpg",
    "image3Alt": "img ports"
}
  